const a = [
  {
    instructor: [
      '市川 創作,野村 名可男',
      '市川 創作,野村 名可男',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '狩野 均',
      '狩野 均',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一'
    ],
    lecture_code: 'GB20201',
    lecture_name: '数理アルゴリズムとシミュレーション',
    room: [
      '2D202',
      '2D202',
      '3A301',
      '3A301',
      '3A301',
      '3A301',
      '3A403',
      '3A403',
      '3B203',
      '3B203',
      '3B203'
    ]
  },
  {
    instructor: [
      '市川 創作,野村 名可男',
      '市川 創作,野村 名可男',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '狩野 均',
      '狩野 均',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一'
    ],
    lecture_code: 'GB20201',
    lecture_name: '数理アルゴリズムとシミュレーション',
    room: [
      '2D202',
      '2D202',
      '3A301',
      '3A301',
      '3A301',
      '3A301',
      '3A403',
      '3A403',
      '3B203',
      '3B203',
      '3B203'
    ]
  },
  {
    instructor: [
      '市川 創作,野村 名可男',
      '市川 創作,野村 名可男',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '狩野 均',
      '狩野 均',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一'
    ],
    lecture_code: 'GB20201',
    lecture_name: '数理アルゴリズムとシミュレーション',
    room: [
      '2D202',
      '2D202',
      '3A301',
      '3A301',
      '3A301',
      '3A301',
      '3A403',
      '3A403',
      '3B203',
      '3B203',
      '3B203'
    ]
  },
  {
    instructor: [
      '市川 創作,野村 名可男',
      '市川 創作,野村 名可男',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '狩野 均',
      '狩野 均',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一'
    ],
    lecture_code: 'GB20201',
    lecture_name: '数理アルゴリズムとシミュレーション',
    room: [
      '2D202',
      '2D202',
      '3A301',
      '3A301',
      '3A301',
      '3A301',
      '3A403',
      '3A403',
      '3B203',
      '3B203',
      '3B203'
    ]
  },
  {
    instructor: [
      '市川 創作,野村 名可男',
      '市川 創作,野村 名可男',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '狩野 均',
      '狩野 均',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一'
    ],
    lecture_code: 'GB20201',
    lecture_name: '数理アルゴリズムとシミュレーション',
    room: [
      '2D202',
      '2D202',
      '3A301',
      '3A301',
      '3A301',
      '3A301',
      '3A403',
      '3A403',
      '3B203',
      '3B203',
      '3B203'
    ]
  },
  {
    instructor: [
      '市川 創作,野村 名可男',
      '市川 創作,野村 名可男',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '狩野 均',
      '狩野 均',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一'
    ],
    lecture_code: 'GB20201',
    lecture_name: '数理アルゴリズムとシミュレーション',
    room: [
      '2D202',
      '2D202',
      '3A301',
      '3A301',
      '3A301',
      '3A301',
      '3A403',
      '3A403',
      '3B203',
      '3B203',
      '3B203'
    ]
  },
  {
    instructor: [
      '市川 創作,野村 名可男',
      '市川 創作,野村 名可男',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '狩野 均',
      '狩野 均',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一'
    ],
    lecture_code: 'GB20201',
    lecture_name: '数理アルゴリズムとシミュレーション',
    room: [
      '2D202',
      '2D202',
      '3A301',
      '3A301',
      '3A301',
      '3A301',
      '3A403',
      '3A403',
      '3B203',
      '3B203',
      '3B203'
    ]
  },
  {
    instructor: [
      '市川 創作,野村 名可男',
      '市川 創作,野村 名可男',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '狩野 均',
      '狩野 均',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一'
    ],
    lecture_code: 'GB20201',
    lecture_name: '数理アルゴリズムとシミュレーション',
    room: [
      '2D202',
      '2D202',
      '3A301',
      '3A301',
      '3A301',
      '3A301',
      '3A403',
      '3A403',
      '3B203',
      '3B203',
      '3B203'
    ]
  },
  {
    instructor: [
      '市川 創作,野村 名可男',
      '市川 創作,野村 名可男',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '狩野 均',
      '狩野 均',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一'
    ],
    lecture_code: 'GB20201',
    lecture_name: '数理アルゴリズムとシミュレーション',
    room: [
      '2D202',
      '2D202',
      '3A301',
      '3A301',
      '3A301',
      '3A301',
      '3A403',
      '3A403',
      '3B203',
      '3B203',
      '3B203'
    ]
  },
  {
    instructor: [
      '市川 創作,野村 名可男',
      '市川 創作,野村 名可男',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '狩野 均',
      '狩野 均',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一'
    ],
    lecture_code: 'GB20201',
    lecture_name: '数理アルゴリズムとシミュレーション',
    room: [
      '2D202',
      '2D202',
      '3A301',
      '3A301',
      '3A301',
      '3A301',
      '3A403',
      '3A403',
      '3B203',
      '3B203',
      '3B203'
    ]
  },
  {
    instructor: [
      '市川 創作,野村 名可男',
      '市川 創作,野村 名可男',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '狩野 均',
      '狩野 均',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一'
    ],
    lecture_code: 'GB20201',
    lecture_name: '数理アルゴリズムとシミュレーション',
    room: [
      '2D202',
      '2D202',
      '3A301',
      '3A301',
      '3A301',
      '3A301',
      '3A403',
      '3A403',
      '3B203',
      '3B203',
      '3B203'
    ]
  },
  {
    instructor: [
      '市川 創作,野村 名可男',
      '市川 創作,野村 名可男',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '藤原 良淑',
      '狩野 均',
      '狩野 均',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一',
      '櫻井 鉄也,今倉 暁,保國 惠一'
    ],
    lecture_code: 'GB20201',
    lecture_name: '数理アルゴリズムとシミュレーション',
    room: [
      '2D202',
      '2D202',
      '3A301',
      '3A301',
      '3A301',
      '3A301',
      '3A403',
      '3A403',
      '3B203',
      '3B203',
      '3B203'
    ]
  }
];
